
# !/usr/bin/env python
# _*_ coding:utf-8 _*_

print '''
<电影达人挑战>
豆瓣网排名前250的电影，你看过多少？
作者：Shawn_张
'''
print '''
使用说明：
程序将会自动展示250部电影的名称。如果看过就按“Y”，否则直接按任意键继续
在最后，会有程序测试结果的相关统计
鸣谢：250部参与测试的电影全部基于另外一个爬虫程序对“豆瓣电影”的信息收集的结果，在此对“豆瓣”表示感谢。
P.S：“豆瓣”总是敞开大门欢迎来自世界各地、出于各种目的爬虫的光顾，每当我想到这里总会觉得很感动 T_T
'''

# 使用最笨的数组方法
# 也可以直接读取TXT文件
movies=[
'肖申克的救赎','控方证人','这个杀手不太冷','阿甘正传','霸王别姬','美丽人生','辛德勒的名单','机器人总动员','海豚湾','十二怒汉', '千与千寻',
'盗梦空间','放牛班的春天','忠犬八公的故事','教父','乱世佳人','大闹天宫','城市之光','泰坦尼克号','三傻大闹宝莱坞','龙猫','大话西游之大圣娶亲',
'天堂电影院','指环王3','鬼子来了','窃听风暴','熔炉','教父2','美国往事','小鞋子','摩登时代','七武士','辩护人','迁徙的鸟','爱·回家','黄金三镖客',
'搏击俱乐部','两杆大烟枪','天空之城','飞越疯人院','活着','少年派的奇幻漂流','钢琴家','海洋','完美的世界','狩猎','追随','素媛','忠犬八公物语', 
'我爱你','当幸福来敲门','楚门的世界','罗马假日','飞屋环游记','大话西游之月光宝盒','怦然心动','无间道','闻香识女人','蝙蝠侠：黑暗骑士',
'指环王2：双塔奇兵','指环王1：魔戒再现','美丽心灵','死亡诗社','音乐之声','被嫌弃的松子的一生', '玛丽和马克思','上帝之城','饮食男女',
'一一 ', # 可能是爬虫的一个BUG，我也不知道这是什么
'虎口脱险','雨中曲','与狼共舞','勇士','伴我同行','天使爱美丽','V字仇杀队','情书','勇敢的心','哈尔的移动城堡','致命魔术','狮子王','入殓师',
'拯救大兵瑞恩','第六感','阳光姐妹淘','萤火虫之墓','风之谷','燃情岁月','侧耳倾听','魂断蓝桥','卢旺达饭店','我是山姆','玩具总动员3','疯狂原始人',
'穿条纹睡衣的男孩','萤火之森','地球上的星星','惊魂记','寿司之神','疯狂约会美丽都','刺猬的优雅','剪刀手爱德华','七宗罪','低俗小说','沉默的羔羊',
'本杰明·巴顿奇事','大鱼','射雕英雄传之东成西就','黑客帝国','阳光灿烂的日子','幽灵公主','让子弹飞','心灵捕手','甜蜜蜜','春光乍泄','爱在黎明破晓前',
'爱在日落黄昏时','驯龙高手','菊次郎的夏天','超脱','借东西的小人阿莉埃蒂','穿越时空的少女','谍影重重3','碧海蓝天','海盗电台','教父3','纵横四海',
'英雄本色','浪潮','荒野生存','梦之安魂曲','喜宴','燕尾蝶','罗生 门','一次别离','绿里奇迹','红辣椒','布达佩斯大饭店','中央车站','哪吒闹海',
'跳出我天地','再见列宁','我在伊朗长大','大卫·戈尔的一生','恐怖直播','未麻的部屋','无敌破坏王','蓝白红三部曲之红','千钧一发 ','蝴蝶效应',
'西西里的美丽传说','重庆森林','告白','阿凡达','电锯惊魂','幸福终点站','岁月神偷','雨人','猫鼠游戏','人工智能','撞车','末代皇帝','可可西里',
'叫我第一名','卡萨布兰卡','哈利·波特与死亡圣器(下)','上帝也疯狂','巴黎淘气帮','蝴蝶','非常嫌疑犯','末路狂花','7号房的礼物','我们俩','不一样的天空',
'牯岭街少年杀人事件','莫扎特传','洛城机密','加勒比海盗','致命ID','真爱至上','禁闭岛','猜火车','神偷奶爸','东邪西毒','贫民窟的百万富翁','断背山',
'恋恋笔记本','记忆碎片','怪兽电力公司','倩女幽魂','秒速5厘米','哈利·波特与魔法石','杀人回忆','黑天鹅','战争之王','勇闯夺命岛','E.T. 外星人',  
'谍影重重2','阿飞正传','这个男人来自地球','麦兜故事','终结者2','偷拐抢骗','遗愿清单','月球','廊桥遗梦','帝企鹅日记','枪火','茜茜公主','香水',
'傲慢与偏见','冰川时代','朗读者','英国病人','穆赫兰道','谍影重重','变脸','曾经','发条橙','魔女宅急便','罪恶之城','美国丽人','暖暖内含光',
'新龙门客栈','黑客帝国3：矩阵革命','导盲犬小Q','荒岛余生','血钻','角斗士','黑鹰坠落','她比烟花寂寞','蓝色大门','爱在暹罗','花样年华',
'夜访吸血鬼','青蛇','初恋这件小事','无耻混蛋','源代码','国王的演讲','八月迷情','两小无猜','唐伯虎点秋香','喜剧之王','恐怖游轮','假如爱有天意',
'疯狂的石头'
 ]

score=0
have_watched=[]                          # 建立一个空数组

def func_have_watched(movie):            # 建立func_have_watched函数，用于添加数组元素
	have_watched.append(movie)
	return have_watched

for movie in movies:       
	print movie                       # 遍历数组movies元素，并取出movie
	answer=raw_input("如果看过就按 Y ,然后按return键继续；否则直接按return键继续。。")
	if answer=="Y" or answer=="y":    # 判断用户命令
		score=score+0.4
		print "当前分数：",score
		func_have_watched(movie)  # 调用func_have_watched函数
	else:
		pass

if score<=60:
	print '总得分', score
	print "不及格，重修！"
else:
	print '总得分', score
	print "及格了，不错。"

print '你看过这些：',have_watched

